# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [4]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [5]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [29]:
# 計算每個不同種類 animal 的 age 的平均數
# 計算每個不同種類 animal 的 age 的平均數
print(df.groupby('animal').age.mean())
# 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
print(df.sort_values(by=['age','visits'],ascending=[True,False]))
# 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df['priority'].replace('yes', True, inplace = True)
df['priority'].replace('no', False, inplace = True)
print(df)

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64
  animal  age  visits  priority
c  snake  0.5       2     False
f    cat  2.0       3     False
a    cat  2.5       1      True
b    cat  3.0       3      True
j    dog  3.0       1     False
g  snake  4.5       1     False
e    dog  5.0       2     False
i    dog  7.0       2     False
d    dog  NaN       3      True
h    cat  NaN       1      True
  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [82]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.319494  0.238283  0.636427
1  0.722307  0.424604  0.614528
2  0.516062  0.963545  0.764665
3  0.005831  0.950665  0.946325
4  0.564145  0.481231  0.588380

In [ ]:
#將每個數字減去該欄位的平均數

          0         1         2
0  0.130010  0.316253  0.158839
1  0.148624 -0.524442  0.117382
2 -0.085726  0.073242 -0.620083
3  0.129444  0.056036  0.155504
4 -0.322352  0.078911  0.188358

In [ ]:
#將每個數字減去該筆資料平均數
df['avg']=df.mean(axis=1)
print(df.apply(lambda x : x-df.avg))

          0         1         2
0 -0.068501  0.014680  0.053821
1  0.237960 -0.538169  0.300209
2  0.128320  0.184225 -0.312545
3  0.018972 -0.157497  0.138525
4 -0.300801 -0.002600  0.303401

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [83]:
df

          0         1         2
0  0.319494  0.238283  0.636427
1  0.722307  0.424604  0.614528
2  0.516062  0.963545  0.764665
3  0.005831  0.950665  0.946325
4  0.564145  0.481231  0.588380

In [94]:
#哪一筆的資料總合最小
df.sum(axis=1).min()

1.1942034467233396

In [98]:
#哪一欄位的資料總合最小
df.sum().min()

2.1278387627940756